[{
  "text": "Genius is one percent inspiration and ninety-nine percent perspiration.",
  "author": "Thomas Edison"
},
{
  "text": "You can observe a lot just by watching.",
  "author": "Yogi Berra"
},
{
  "text": "A house divided against itself cannot stand.",
  "author": "Abraham Lincoln"
},
{
  "text": "Difficulties increase the nearer we get to the goal.",
  "author": "Johann Wolfgang von Goethe"
},
{
  "text": "Fate is in your hands and no one elses",
  "author": "Byron Pulsifer"
},
{
  "text": "Be the chief but never the lord.",
  "author": "Lao Tzu"
},
{
  "text": "Nothing happens unless first we dream.",
  "author": "Carl Sandburg"
},
{
  "text": "Well begun is half done.",
  "author": "Aristotle"
},
{
  "text": "Life is a learning experience, only if you learn.",
  "author": "Yogi Berra"
},
{
  "text": "Self-complacency is fatal to progress.",
  "author": "Margaret Sangster"
},
{
  "text": "Peace comes from within. Do not seek it without.",
  "author": "Buddha"
},
{
  "text": "What you give is what you get.",
  "author": "Byron Pulsifer"
},
{
  "text": "We can only learn to love by loving.",
  "author": "Iris Murdoch"
},
{
  "text": "Life is change. Growth is optional. Choose wisely.",
  "author": "Karen Clark"
},
{
  "text": "You'll see it when you believe it.",
  "author": "Wayne Dyer"
},
{
  "text": "Today is the tomorrow we worried about yesterday.",
  "author": null
},
{
  "text": "It's easier to see the mistakes on someone else's paper.",
  "author": null
},
{
  "text": "Every man dies. Not every man really lives.",
  "author": null
},
{
  "text": "To lead people walk behind them.",
  "author": "Lao Tzu"
},
{
  "text": "Having nothing, nothing can he lose.",
  "author": "William Shakespeare"
},
{
  "text": "Trouble is only opportunity in work clothes.",
  "author": "Henry J. Kaiser"
},
{
  "text": "A rolling stone gathers no moss.",
  "author": "Publilius Syrus"
},
{
  "text": "Ideas are the beginning points of all fortunes.",
  "author": "Napoleon Hill"
},
{
  "text": "Everything in life is luck.",
  "author": "Donald Trump"
},
{
  "text": "Doing nothing is better than being busy doing nothing.",
  "author": "Lao Tzu"
},
{
  "text": "Trust yourself. You know more than you think you do.",
  "author": "Benjamin Spock"
},
{
  "text": "Study the past, if you would divine the future.",
  "author": "Confucius"
},
{
  "text": "The day is already blessed, find peace within it.",
  "author": null
},
{
  "text": "From error to error one discovers the entire truth.",
  "author": "Sigmund Freud"
},
{
  "text": "Well done is better than well said.",
  "author": "Benjamin Franklin"
},
{
  "text": "Bite off more than you can chew, then chew it.",
  "author": "Ella Williams"
},
{
  "text": "Work out your own salvation. Do not depend on others.",
  "author": "Buddha"
},
{
  "text": "One today is worth two tomorrows.",
  "author": "Benjamin Franklin"
},
{
  "text": "Once you choose hope, anythings possible.",
  "author": "Christopher Reeve"
},
{
  "text": "God always takes the simplest way.",
  "author": "Albert Einstein"
},
{
  "text": "One fails forward toward success.",
  "author": "Charles Kettering"
},
{
  "text": "From small beginnings come great things.",
  "author": null
},
{
  "text": "Learning is a treasure that will follow its owner everywhere",
  "author": "Chinese proverb"
},
{
  "text": "Be as you wish to seem.",
  "author": "Socrates"
},
{
  "text": "The world is always in movement.",
  "author": "V. Naipaul"
},
{
  "text": "Never mistake activity for achievement.",
  "author": "John Wooden"
},
{
  "text": "What worries you masters you.",
  "author": "Haddon Robinson"
},
{
  "text": "One faces the future with ones past.",
  "author": "Pearl Buck"
},
{
  "text": "Goals are the fuel in the furnace of achievement.",
  "author": "Brian Tracy"
},
{
  "text": "Who sows virtue reaps honour.",
  "author": "Leonardo da Vinci"
},
{
  "text": "Be kind whenever possible. It is always possible.",
  "author": "Dalai Lama"
},
{
  "text": "Talk doesn't cook rice.",
  "author": "Chinese proverb"
},
{
  "text": "He is able who thinks he is able.",
  "author": "Buddha"
},
{
  "text": "A goal without a plan is just a wish.",
  "author": "Larry Elder"
},
{
  "text": "To succeed, we must first believe that we can.",
  "author": "Michael Korda"
},
{
  "text": "Программирование сегодня — это гонка разработчиков программ, стремящихся писать программы с большей и лучшей идиотоустойчивостью, и вселенной, которая пытается создать больше отборных идиотов. Пока вселенная побеждает.",
  "author": "Rick Cook"
},
{
  "text": "Низкоуровневый язык — это когда требуется внимание к вещам, которые никак не связаны с программами на этом языке.",
  "author": "Alan J. Perlis"
},
{
  "text": "Программирование на С похоже на быстрые танцы на только что отполированном полу людей с острыми бритвами в руках.",
  "author": "Waldi Ravens"
},
{
  "text": "Не волнуйтесь, если что-то не работает. Если бы всё работало, вас бы уволили.",
  "author": "Mosher’s Law of Software Engineering"
},
{
  "text": "Для меня долгое время было загадкой, как что-то очень дорогое и технологичное может быть столь бесполезным. И вскоре я осознал, что компьютер — это глупая машина, обладающая способностями выполнять невероятно умные вещи, тогда как программисты — это умные люди, у которых талант делать невероятные глупости. Короче, они нашли друг друга.",
  "author": "Bill Bryson"
},
{
  "text": "В хорошем дизайне добавление чего-то стоит дешевле, чем сама эта вещь.",
  "author": "Thomas C. Gale"
},
{
  "text": "В теории, теория и практика неразделимы. На практике это не так.",
  "author": "Yoggi Berra"
},
{
  "text": "Perl — это тот язык, который одинаково выглядит как до, так и после RSA шифрования.",
  "author": "Keith Bostic"
},
{
  "text": "Я изобрел понятие «объектно-ориентированный», и могу заявить, что не имел в виду C++.",
  "author": "Alan Kay"
},
{
  "text": "Иногда лучше остаться спать дома в понедельник, чем провести всю неделю в отладке написанного в понедельник кода.",
  "author": "Christopher Thompson"
},
{
  "text": "Измерять продуктивность программиста подсчетом строк кода — это так же, как оценивать постройку самолета по его весу.",
  "author": "Bill Gates"
},
{
  "text": "Отладка кода вдвое сложнее, чем его написание. Так что если вы пишете код настолько умно, насколько можете, то вы по определению недостаточно сообразительны, чтобы его отлаживать.",
  "author": "Brian W. Kernighan"
},
{
  "text": "Многие из вас знакомы с достоинствами программиста. Их всего три, и разумеется это: лень, нетерпеливость и гордыня.",
  "author": "Larry Wall"
},
{
  "text": "Большинство программ на сегодняшний день подобны египетским пирамидам из миллиона кирпичиков друг на друге и без конструктивной целостности — они просто построены грубой силой и тысячами рабов.",
  "author": "Alan Kay"
},
{
  "text": "Большинство хороших программистов делают свою работу не потому, что ожидают оплаты или признания, а потому что получают удовольствие от программирования.",
  "author": "Linus Torvalds"
},
{
  "text": "Всегда пишите код так, будто сопровождать его будет склонный к насилию психопат, который знает, где вы живете.",
  "author": "Martin Golding"
},
{
  "text": "Программы должны писаться для людей, которые будут их читать, а машины, которые будут эти программы исполнять — второстепенны.",
  "author": "Harold Abelson"
},
{
  "text": "Люди, которые думают, что ненавидят компьютеры, на самом деле ненавидят плохих программистов.",
  "author": "Larry Niven"
},
{
  "text": "Если вы дадите человеку программу, то займете его на один день. Если вы научите человека программировать, то займете его на всю жизнь.",
  "author": "Waseem Latif"
},
{
  "text": "Язык, который не меняет вашего представления о программировании, недостоин изучения.",
  "author": "Alan J. Perlis"
},
{
  "text": "Мы наблюдаем общество, которое все больше зависит от машин, но при этом использует их все неэффективнее.",
  "author": "Douglas Rushkoff"
},
{
  "text": "Иногда лучшие программы создаются на бумажке. Запрограммировать их — второстепенная вещь.",
  "author": "Max Kanat-Alexander"
},
{
  "text": "Отладка кода — это как охота. Охота на баги.",
  "author": "Amit Kalantri"
},
{
  "text": "Любой дурак сможет написать код, который поймет машина. Хорошие программисты пишут код, который сможет понять человек.",
  "author": "Martin Fowler"
},
{
  "text": "Программирование — это разбиение чего-то большого и невозможного на что-то маленькое и вполне реальное.",
  "author": "Jazzwant"
},
{
  "text": "Программисты — не математики, как бы нам этого ни хотелось.",
  "author": "Richard P. Gabriel"
},
{
  "text": "Программирование — это сложно. Основные правила, на которых все строится, очень просты, но по мере разработки программа сама начинает вводить свои правила и законы. Таким образом, программист строит лабиринт, в котором сам же может и потеряться.",
  "author": "Marijn Haverbeke"
},
{
  "text": "Функции, которые производят значения, легче комбинировать новыми способами, чем те, которые производят сайд-эффекты.",
  "author": "Marijn Haverbeke"
},
{
  "text": "Простота — залог надежности.",
  "author": "Edsger W. Dijkstra"
},
{
  "text": "Если вы хотите, чтобы код было легко и быстро писать — делайте его удобным для чтения.",
  "author": "Robert C. Martin"
},
{
  "text": "Если вы хорошо отлаживаете программы, значит, вы провели много времени, делая это. Я не хочу уметь хорошо отлаживать программы.",
  "author": "Michael C. Feathers"
},
{
  "text": "Работает? Не трогай.",
  "author": "Любой программист"
},
{
  "text": "При помощи C вы легко можете выстрелить себе в ногу. При помощи C++ это сделать сложнее, но если это произойдёт, вам оторвёт всю ногу целиком.",
  "author": "Bjarne Stroustrup"
},
{
  "text": "Последние нововведения в C++ были созданы, чтобы исправить предыдущие нововведения.",
  "author": "David Jameson"
},
{
  "text": "Java — это C++, из которого убрали все пистолеты, ножи и дубинки.",
  "author": "James Gosling"
},
{
  "text": "Если бы в Java действительно работала сборка мусора, большинство программ бы удаляли сами себя при первом же запуске.",
  "author": "Robert Sewell"
},
{
  "text": "Есть всего два типа языков программирования: те, на которые люди всё время ругаются, и те, которые никто не использует.",
  "author": "Bjarne Stroustrup"
},
{
  "text": "Плохое имя метода сродни предвыборным обещаниям политиков. Вроде о чем-то оно говорит, но если задуматься — непонятно о чем.",
  "author": "C. MacConnell"
},
{
  "text": "Неработающая программа обычно приносит меньше вреда, чем работающая плохо.",
  "author": "Dave Thomas"
},
{
  "text": "Насколько проще было бы писать программы, если бы не заказчики.",
  "author": "R. S. Martin"
},
{
  "text": "Молодые специалисты не умеют работать, а опытные специалисты умеют не работать.",
  "author": "Alexander Golov"
},
{
  "text": "Почаще задавайте себе вопрос «Что мне скрыть?» и вы удивитесь, сколько проблем проектирования растает на ваших глазах.",
  "author": "C. MacConnell"
},
{
  "text": "Преждевременная оптимизация — корень всех зол.",
  "author": "Donald Knuth"
},
{
  "text": "Чтобы написать чистый код, мы сначала пишем грязный код, а затем рефакторим его.",
  "author": "Robert Martin"
},
{
  "text": "Помимо математических способностей, жизненно важным качеством программиста является исключительно хорошее владение родным языком.",
  "author": "Edsger W. Dijkstra"
},
{
  "text": "Для каждой сложной задачи существует решение, которое является быстрым, простым и неправильным.",
  "author": "H. L. Mencken"
},
{
  "text": "Механизмы управления доступом в С++ обеспечивают защиту от несчастного случая, но не от мошенников.",
  "author": "Bjarne Stroustrup"
},
{
  "text": "Механизмы управления доступом в С++ обеспечивают защиту от несчастного случая, но не от мошенников.",
  "author": "Bjarne Stroustrup"
},
{
  "text": "Думаю, искусство программировать немногим сложнее других человеческих навыков. Программирование делает вас лучше точно так же, как вам помогают развиваться изучение иностранного языка, математики или чтение книг.",
  "author": "Jack Dorsey"
},
{
  "text": "Аналогично тому, как написание картины является искусством для души, так и написание программы является искусством для разума.",
  "author": "Volnik"
}
]